//Код програми 12.6. Демонстрація механізму використання базових операцій для роботи зі списком

#include <iostream>		 	// Для потокового введення-виведення
#include <cstdlib>			// Стандартна бібліотека С++
#include <vector>			// Для роботи з контейнерним класом "Вектор"
#include <list> 			// Для роботи зі списками

using namespace std; 			// Використання стандартного простору імен

int main()
{
    list<char> lst; // Створення порожнього списку
    // Поміщаємо значення у список
    for(int i=0; i<10; i++) lst.push_back('A'+i);

    // Відображаємо початковий розміру списку
    cout << "Розмiр = " << lst.size() << endl;

    // Відображаємо початковий вміст списку
    cout << "Вмiст: ";
    list<char>::iterator p = lst.begin();
    // Отримуємо доступ до вмісту списку за допомогою ітератора.
    while(p != lst.end()) {
        cout << *p << " ";
        p++;
        cout << endl;
    }

    //system("PAUSE");
    return EXIT_SUCCESS;
}
