//Код програми 11.8. Демонстрація механізму використання покажчиків
//на двіперевизначені функції для виведення на екран відповіднопропусків і символів

#include <iostream>		 		// Для потокового введення-виведення
#include <cstdlib>				// Стандартна бібліотека С++

using namespace std; 			// Використання стандартного простору імен

// Введення на екран count пропусків.
void space(int count)
{
    for(; count; count--) cout << " ";
}
// Введення на екран count символів, переданих в ch.
void space(int count, char ch)
{
    for(; count; count--) cout << ch;
}
int main()
{
    // Створення покажчика на void-функцію з одним int-				параметром.
    void (*fp1)(int);

    /* Створення покажчика на void-функцію з одним int-				параметром і одним параметром типу char. */
    void (*fp2)(int, char);

    fp1 = space; // Отримуємо адресу функції space(int)

    fp2 = space; // Отримуємо адресу функції space(int, char)

    fp1(22); // Виводимо 22 пропуски (цей виклик є аналогічним
    // виклику (*fp1)(22)).
    cout << "|" << endl;

    fp2(30, 'x'); // Виводимо 30 символів "x" (цей виклик є
    // аналогічним до виклику (*fp2)(30, 'x').
    cout << "|" << endl;

    //system("PAUSE");
    return EXIT_SUCCESS;
}
