//Код програми 9.6. Демонстрація механізму використання маніпуляторів для керування процесом форматування даних, які виводяться

#include <iostream>		 		// Для потокового введення-виведення
#include <cstdlib>				// Стандартна бібліотека С++
#include <iomanip> // Використанняманіпуляторів введення-виведення

using namespace std; 			// Використання стандартного простору імен

int main()
{
    cout << setprecision(2) << 1000.243 << endl;
    cout << setw(20) << "Всiм привiт! ";

    //system("PAUSE");
    return EXIT_SUCCESS;
}
