//Код програми 3.15. Демонстрація механізму використання конструктора копії для створення тимчасового об'єкта, що повертається функцією

#include <iostream>		 		// Для потокового введення-виведення
#include <cstdlib>				// Стандартна бібліотека С++

using namespace std; 			// Використання стандартного простору імен

class myClass { // Оголошення класового типу
public:
    myClass() { cout << "Звичайний конструктор" << endl; }
    myClass(const myClass &obj) { cout << "Конструктор копiї" << endl; }
};
myClass Fun()
{
    myClass obj; // Викликається звичайний конструктор.
    return obj; // Опосередковано викликається конструктор копії.
}

int main()
{
    myClass ObjA; // Викликається звичайний конструктор.
    ObjA = Fun(); // Викликається конструктор копії.

    //system("PAUSE");
    return EXIT_SUCCESS;
}
