//Код програми 9.4. Демонстрація механізму використання функцій flags() і unsetf()

#include <iostream>		 		// Для потокового введення-виведення
#include <cstdlib>				// Стандартна бібліотека С++

using namespace std; 			// Використання стандартного простору імен


void showflags(ios::fmtflags f) // Відображення поточного стану опцій
{
    long i;
    for(i=0x4000; i; i = i >> 1)
        if(i & f) cout << "1 ";
        else cout << "0 ";
    cout << endl;
}

int main()
{
    ios::fmtflags f; // Оголошення параметру для поточного стану опцій
    f = cout.flags();		 // Отримання поточного стану опцій
    showflags(f); 		// Відображення поточного стану опцій
    cout.setf(ios::showpos);		 // Відображення знаку "+" перед позитивним значенням
    cout.setf(ios::scientific); // Відображення чисел у експоненціальному вигляді

    f = cout.flags(); // Отримання поточного стану опцій
    showflags(f); // Відображення поточного стану опцій

    // Скидання опції, що відображає числа в експоненціальному вигляді cout.unsetf(ios::scientific);
    f = cout.flags(); 	// Отримання поточного стану опцій
    showflags(f);	 // Відображення поточного стану опцій

    //system("PAUSE");
    return EXIT_SUCCESS;
}
