//Код програми 12.1. Демонстрація механізму базової поведінки вектора

#include <iostream>		 		// Для потокового введення-виведення
#include <cstdlib>				// Стандартна бібліотека С++
#include <vector>				// Для роботи з контейнерним класом "Вектор"

using namespace std; 			// Використання стандартного простору імен

int main()
{
    vector<int> vek; // Створення вектора нульової довжини

    // Відображаємо початковий розмір вектора vek.
    cout << "Розмiр = " << vek.size() << endl;

    /* Поміщаємо значення у кінець вектора, і розмір
    вектора за потреби збільшуватиметься. */
    for(int i=0; i<10; i++) {
        vek.push_back(i);
    }

    // Відображаємо поточний розмір вектора vek.
    cout << "Новий розмiр = " << vek.size() << endl;

    // Відображаємо вміст вектора.
    cout << "Поточний вмiст:" << endl;
    for(int i = 0; i < vek.size(); i++) {
        cout << vek[i] << " ";
    }
    cout << endl;


    /* Поміщаємо у кінець вектора нові значення, і розмір
    вектора за потреби збільшуватиметься. */
    for(int i=0; i < 10; i++) {
        vek.push_back(i + 10);
    }
    // //Відображаємо поточний розмір вектора vek.
    cout << "Новий розмiр = " << vek.size() << endl;

    // Відображаємо новий вміст вектора.
    cout << "Новий вмiст:" << endl;
    for(int i=0; i < vek.size(); i++) cout << vek[i] << " ";
    cout << endl;

    // Змінюємо вміст вектора.
    for(int i = 0; i < vek.size(); i++) {
        vek[i] = vek[i] + vek[i];
    }

    // Відображаємо вміст вектора.
    cout << "Вмiст подвоєно:" << endl;
    for(int i=0; i<vek.size(); i++) {
        cout << vek[i] << " ";
    }
    cout << endl;

    //system("PAUSE");
    return EXIT_SUCCESS;
}
