//Код програми 8.2. Демонстрація не коректної роботи коду програми

#include <iostream>		 		// Для потокового введення-виведення
#include <cstdlib>				// Стандартна бібліотека С++

using namespace std; 			// Використання стандартного простору імен

int main()
{
    cout << "Початок" << endl;
    try { // Початок try-блоку
        cout << "У try-блоцi" << endl;
        throw 99; // генерування помилки
        cout << "Ця настанова не буде виконана.";
    }
    catch(double c) { // Перехоплення винятку типу int не відбудеться.
        cout << "Значення перехопленого винятку дорiвнює: ";
        cout << c << endl;
    }
    cout << "Кiнець програми";

    //system("PAUSE");
    return EXIT_SUCCESS;
}
