//Код програми 2.15. Демонстрація механізму інкрементування та декрементування покажчика на об'єкт

#include <iostream>		 		// Для потокового введення-виведення
#include <cstdlib>				// Стандартна бібліотека С++

using namespace std; 			// Використання стандартного простору імен

class pClass { 		// Оголошення класового типу
    int num;
public:
    void Set(int n) { num = n; }
    void Show() { cout << "num= " << num << endl; }
};

int main()
{
    pClass Obj[2],*p;	//Оголошення масиву об'єктів і покажчика
    Obj[0].Set(10);     // Прямий доступ до об'єктів
    Obj[1].Set(20);

    p = &Obj[0]; 		// Отримуємо покажчик на перший елемент.
    p->Show(); 		// Відображаємо значення елемента Obj[0] за допомогою покажчика.

    p++;			// Переходимо до наступного об'єкта.
    p->Show(); 	 	// Відображаємо значення елемента Obj[1] за    допомогою покажчика.

    p--;			// Повертаємося до попереднього об'єкта.
    p->Show(); 		// Знову відображаємо значення елемента Obj[0].

    //system("PAUSE");
    return EXIT_SUCCESS;
}
