//Код програми 3.7. Демонстрація механізму передачі об'єктів функціям

#include <iostream>		 		// Для потокового введення-виведення
#include <cstdlib>				// Стандартна бібліотека С++

using namespace std; 			// Використання стандартного простору імен

class myClass { // Оголошення класового типу
    int c;
public:
    myClass() { c = 0; }
    void Set(int _c) { c = _c; }
    void Show(char *s) { cout << s << c << endl; }
};
void Fun(myClass obj) // Визначення функції не члена класу
{
    obj.Show("t2= "); // Виведення числа 10.
    obj.Set(100); // Встановлює тільки локальну копію.
    obj.Show("t3= "); // Виведення числа 100.
}

int main()
{
    myClass Obj; // Створення об'єкта класу
    Obj.Set(10);
    Obj.Show("t1= "); // Виведення числа 10.
    Fun(Obj); // Передача об'єкта функції не члена класу
    Obj.Show("t4= "); // Як і раніше, виводиться число 10, проте
    // значення змінної "i" не змінилося.

    //system("PAUSE");
    return EXIT_SUCCESS;
}
