//Код програми 2.5. Демонстрація механізму доступу до членів класу

#include <iostream>		 		// Для потокового введення-виведення
#include <cstdlib>				// Стандартна бібліотека С++

using namespace std; 			// Використання стандартного простору імен

class myClass { 			 // Оголошення класового типу
private:
    int a; 				 // Закритий член-даних
public:
    int b;				 // Відкритий член-даних
    void Set(int c); 	 	 // Відкриті функції-члени класу
    double Put();
    void Fun();
};
void myClass::Set(int c) 	 // Надання значень членам-даних
{
    a = c;				 // Пряме звернення до змінної a
    b = c*c; 			 // Пряме звернення до змінної b
}
double myClass::Put() 		 // Повернення значення закритого члена даних
{
    return a; 			 // Пряме звернення до змінної a
}
void myClass::Fun()		 // Надання значень членам-даних
{
    Set(0); 		   // Прямий виклик функції Set() створеним об'єктом
}
int main()
{
    myClass Obj; 	   // Створення об'єкта класу
    Obj.Set(5); 		   // Надання значень членам-дани
    cout << "Об'єкт Obj пiсля виклику функцiї Set(5): " << Obj.Put() << " ";
    // До члена b можна отримати прямий доступ, оскільки він є public-членом.
    cout << Obj.b << endl;
    // Члену b можна надати значення безпосередньо, оскільки він є public-членом.
    Obj.b = 20;
    cout << "Об'єкт Obj пiсля встановлення члена Obj.b=20: ";
    cout << Obj.Put() << " " << Obj.b << endl;
    Obj.Fun();
    cout << "Об'єкт Obj пiсля виклику функцiї Obj.Fun(): ";
    cout << Obj.Put() << " " << Obj.b << endl;

    //system("PAUSE");
    return EXIT_SUCCESS;
}
