// Код програми 9.5. Демонстрація механізму використання функцій встановлення ширини поля, точності та символів заповнення

#include <iostream>
#include <cstdlib>

using namespace std;

int main() {
    cout.setf(ios::showpos);    // Відображення знаку "+" перед позитивним значенням
    cout.setf(ios::scientific); // Відображення чисел у експоненціальному вигляді
    cout << 123 << " " << 123.23 << endl;

    cout.precision(2);          // Дві цифри після десятковоїкрапки
    cout.width(10);             // Все поле складається з 10 символів
    cout << 123 << " ";
    cout.width(10);             // Встановленняширини поля в 10 символів
    cout << 123.23 << endl;

    cout.fill('#');             // Як заповнювач використаємо символ "#"
    cout.width(10);             // Встановлення ширини поля в 10 символів
    cout << 123 << " ";
    cout.width(10);             // Встановленняширини поля в 10 символів
    cout << 123.23;

    //system("PAUSE");
    return EXIT_SUCCESS;
}
