//Код програми 9.5. Демонстраціямеханізму використанняфункцій 	встановлення ширини поля, точності та символів заповнення

#include <iostream>		 		// Для потокового введення-виведення
#include <cstdlib>				// Стандартна бібліотека С++

using namespace std; 			// Використання стандартного простору імен

int main()
{
    cout.setf(ios::showpos); // Відображення знаку "+" перед позитивним значенням
    cout.setf(ios::scientific); // Відображення чисел у експоненціальному вигляді
    cout << 123 << " " << 123.23 << endl;

    cout.precision(2); // Дві цифри після десятковоїкрапки.
    cout.width(10); // Все поле складається з 10 символів.
    cout << 123 << " ";
    cout.width(10); // Встановленняширини поля в 10 символів.
    cout << 123.23 << endl;

    cout.fill('#'); // Якзаповнювач використаємо символ "#"
    cout.width(10); // Встановленняширини поля в 10 символів.
    cout << 123 << " ";
    cout.width(10); // Встановленняширини поля в 10 символів.
    cout << 123.23;

    //system("PAUSE");
    return EXIT_SUCCESS;
}
